package comguigu.exercise;

/**
 * @projectName: MyJavaStudy
 * @package: comguigu.exercise
 * @author: Nightmare970701
 * @description:
 * @since:
 * @version: JDK11
 * @create: 2022-03-05 22:18
 */
public class InterNetTest {

/*
    编写一个服务器和一个客户端
1)服务器可以读取本地文件内容并能将内容发给请求的客户端
2)再编写一个可以发请求到服务器,并能从服务器段获取文件内容的客户端
            编写一个简单的浏览器
1)将第一题的服务器做调整,如果客户端传输字符串: GET HTTP1.0  /index.jsp, 服务器会将指定目录(路径)下的index.jsp文件传输到客户端
2)客户端可以发请求和把上面的文件保存到本机的制定目录下
            编写一个服务器和一个客户端
1)服务器上保存了几个用户名和对应的密码;且能验证客户端发送过来的用户名和密码,是否和保存的某个用户名和对应的密码一致.
2)客户端能连接到服务器，并把用户在键盘上输入的用户名和密码，发送到服务器上
            编写一个ATM服务器和一个客户端,可以通过客户端输入帐号,密码,然后利用服务器端验证,且能实现ATM存钱,取钱和修改密码的功能
    将上面的题目结合JDBC实现模拟银行的功能。(后面讲jdbc)
    网络编程
1)	用网络编程编写一个服务端
2)	编写一个客户端，客户端向服务端发送一条信息
3)	服务端在这条信息前面加上“服务端：”后再返给客户端输出。
    网络聊天功能（50分）
            1)	用网络编程编写一个服务端（5分）
            2)	用网络编写一个客户端（5分）
            3)	客户端输入 client，服务端响应 I'SERVER!（40分）
    实现服务器端和客户端的单线通话（50分）
            1)	实例化一个服务器端(10分)
2)	实例化一个客户端（10分）
            3)	服务器端和客户端相连接（10分）
            4)	一旦服务器端接收到客户端的连接，服务器端就向客户端输出“welcom”（20分）
    TCP/IP通信协议和IO
1)	实例化一个服务端（10分）
            2)	实例化一个客户端，客户端可以向服务端发送一条信息（10分）
            3)	用IO向D盘下面创建temp.txt文件（10分）
            4)	服务端把接收到客户端的信息写到temp.txt文件中(20分)
*/


}